In [42]:
import pandas as pd

In [43]:
#1 .Load the dataset and display shape, columns and data types.
import pandas as pd
df = pd.read_csv(r"C:\Users\DELL\OneDrive\Desktop\techwork(3)(2)\messy_employee_dataset_1000_rows.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [44]:
#1
#df.shape
df.columns
#df.dtypes

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [45]:
#2. calculate percentage of missing values for each column
df.isnull().sum()
df_missing = (df.isnull().sum() / len(df)) * 100


print(df_missing)

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

In [46]:
#3.
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

In [47]:
#4.clean user id by replacing empty strings with nan and converting into uppercase
import numpy as np

df['user_id'] = (
    df['user_id']
    .replace('', np.nan)
    .str.upper()
)
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [48]:
df['user_id'].head()

0    USER_0
1     U1001
2     U1002
3       NaN
4       NaN
Name: user_id, dtype: object

In [49]:
#5.convert age to numeric and replace invalid values(negative or >100) with nan
import numpy as np
# convert to numeric (invalid parsing → NaN)
df['age'] = pd.to_numeric(df['age'], errors='coerce')
# replace negative ages or ages > 100 with NaN
df.loc[(df['age'] < 0) | (df['age'] > 100), 'age'] = np.nan

In [50]:
df['age'].describe()

count    534.000000
mean      35.983146
std       15.746517
min       18.000000
25%       25.000000
50%       30.000000
75%       45.000000
max       60.000000
Name: age, dtype: float64

In [51]:
#6.clean salary by removing currency symbols and converting it to numeric
import numpy as np
df['salary'] = (
    df['salary']
    .replace(r'[^\d.]', '', regex=True)  # remove currency symbols & commas
)

df['salary'] = pd.to_numeric(df['salary'], errors='coerce')

In [52]:
df['salary'].head()

0     50000.00
1     45000.00
2     25000.00
3          NaN
4    120000.75
Name: salary, dtype: float64

In [53]:
#7.convert join date into datetime format handling multiple date formats
df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce', infer_datetime_format=True)
df["joining_year"] = df["join_date"].dt.year
df['join_date']

C:\Users\DELL\AppData\Local\Temp\ipykernel_19708\2108096850.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce', infer_datetime_format=True)

0     2020-12-01
1            NaT
2            NaT
3            NaT
4            NaT
         ...
995          NaT
996          NaT
997          NaT
998          NaT
999          NaT
Name: join_date, Length: 1000, dtype: datetime64[ns]

In [54]:
#8.extract joining year from the cleaned join_date column
df["joining_year"] = df["join_date"].dt.year
df["joining_year"]

0      2020.0
1         NaN
2         NaN
3         NaN
4         NaN
        ...
995       NaN
996       NaN
997       NaN
998       NaN
999       NaN
Name: joining_year, Length: 1000, dtype: float64

In [55]:
#9 standardize department values by trimming spaces and converting to uppercase
df['department'] = df['department'].str.strip().str.upper()
df['department']

0           HR
1      FINANCE
2           HR
3           HR
4           IT
        ...
995         HR
996         IT
997         HR
998        NaN
999         HR
Name: department, Length: 1000, dtype: object

In [56]:
#10 normalize city names to a consistent case and spelling
df['city'] = df['city'].str.strip().str.title()
df['city']

0          Delhi
1          Delhi
2          Delhi
3      Hyderabad
4          Delhi
         ...
995        Delhi
996       Mumbai
997       Mumbai
998    Bangalore
999    Hyderabad
Name: city, Length: 1000, dtype: object

In [57]:
#11 convert performance score into numeric by mapping text values to numbers
performance_mapping = {
    'Excellent': 3,
    'Good': 2,
    'Poor': 1
}

df['performance_score'] = df['performance_score'].map(performance_mapping)
df['performance_score'] = pd.to_numeric(df['performance_score'], errors='coerce')
df['performance_score']

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
995   NaN
996   NaN
997   NaN
998   NaN
999   NaN
Name: performance_score, Length: 1000, dtype: float64

In [58]:
# 12 clean experience years by converting text values to numeric and removing negatives
df['experience_years'] = pd.to_numeric(df['experience_years'], errors='coerce')
df.loc[df['experience_years'] < 0, 'experience_years'] = pd.NA
df['experience_years']

0       NaN
1       1.0
2      10.0
3       5.0
4       NaN
       ...
995     NaN
996     5.0
997     5.0
998     0.0
999     NaN
Name: experience_years, Length: 1000, dtype: float64

In [59]:
# 13 convert is_active values (yes/no/true/false) into boolean format
df['is_active'] = df['is_active'].str.strip().str.lower()
df['is_active'] = df['is_active'].map({'yes': True, 'true': True, 'no': False, 'false': False})
df['is_active']

0       True
1       True
2      False
3       True
4      False
       ...
995      NaN
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: object

In [60]:
#14 identify and remove duplicate records based on user_id
df = df.drop_duplicates(subset=['user_id'])
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.0,HR,2020-12-01,Delhi,NaN,NaN,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,NaN,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,NaN,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,NaN,5.0,True,NaN
5,USER_5,NaN,25000.0,IT,NaT,NaN,NaN,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,USER_997,NaN,25000.0,HR,NaT,Mumbai,NaN,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,NaN,0.0,True,NaN

In [62]:
#15 create a clean final dataframe containing only valid, standardized records
clean_df = df.dropna(subset=['user_id', 'age', 'salary', 'join_date', 'department', 'city', 'performance_score', 'experience_years', 'is_active'])
clean_df.reset_index(drop=True, inplace=True)
clean_df
clean_df.info()
clean_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            0 non-null      object
 1   age                0 non-null      float64
 2   salary             0 non-null      float64
 3   department         0 non-null      object
 4   join_date          0 non-null      datetime64[ns]
 5   city               0 non-null      object
 6   performance_score  0 non-null      float64
 7   experience_years   0 non-null      float64
 8   is_active          0 non-null      object
 9   joining_year       0 non-null      float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 132.0+ bytes

Empty DataFrame
Columns: [user_id, age, salary, department, join_date, city, performance_score, experience_years, is_active, joining_year]
Index: []